
## Plan Result (terraform/tailscale/lolice)

[CI link](https://github.com/boxp/arch/actions/runs/22945109114)


<pre><code>Plan: 9 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * aws_s3_bucket.k8s_oidc
  * aws_s3_bucket_policy.k8s_oidc_public_read
  * aws_s3_bucket_public_access_block.k8s_oidc
  * aws_s3_bucket_server_side_encryption_configuration.k8s_oidc
  * aws_s3_object.oidc_discovery
  * aws_s3_object.oidc_jwks
  * aws_ssm_parameter.operator_wif_audience
  * aws_ssm_parameter.operator_wif_client_id
  * tailscale_federated_identity.k8s_operator
* Update
  * tailscale_acl.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.k8s_oidc will be created
  + resource "aws_s3_bucket" "k8s_oidc" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "lolice-k8s-oidc"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_policy.k8s_oidc_public_read will be created
  + resource "aws_s3_bucket_policy" "k8s_oidc_public_read" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "ap-northeast-1"
    }

  # aws_s3_bucket_public_access_block.k8s_oidc will be created
  + resource "aws_s3_bucket_public_access_block" "k8s_oidc" {
      + block_public_acls       = true
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-northeast-1"
      + restrict_public_buckets = false
    }

  # aws_s3_bucket_server_side_encryption_configuration.k8s_oidc will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "k8s_oidc" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-1"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_object.oidc_discovery will be created
  + resource "aws_s3_object" "oidc_discovery" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = (known after apply)
      + content_type           = "application/json"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = ".well-known/openid-configuration"
      + kms_key_id             = (known after apply)
      + region                 = "ap-northeast-1"
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.oidc_jwks will be created
  + resource "aws_s3_object" "oidc_jwks" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = jsonencode(
            {
              + keys = []
            }
        )
      + content_type           = "application/json"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "openid/v1/jwks"
      + kms_key_id             = (known after apply)
      + region                 = "ap-northeast-1"
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_ssm_parameter.operator_wif_audience will be created
  + resource "aws_ssm_parameter" "operator_wif_audience" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Tailscale WIF audience for the Kubernetes Operator (not a secret)"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/lolice/tailscale/operator-wif-audience"
      + region         = "ap-northeast-1"
      + tags           = {
          + "Project" = "lolice"
          + "Purpose" = "tailscale-k8s-operator-wif"
        }
      + tags_all       = {
          + "Project" = "lolice"
          + "Purpose" = "tailscale-k8s-operator-wif"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.operator_wif_client_id will be created
  + resource "aws_ssm_parameter" "operator_wif_client_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Tailscale WIF client ID for the Kubernetes Operator (not a secret)"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/lolice/tailscale/operator-wif-client-id"
      + region         = "ap-northeast-1"
      + tags           = {
          + "Project" = "lolice"
          + "Purpose" = "tailscale-k8s-operator-wif"
        }
      + tags_all       = {
          + "Project" = "lolice"
          + "Purpose" = "tailscale-k8s-operator-wif"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # tailscale_acl.this will be updated in-place
  ~ resource "tailscale_acl" "this" {
      ~ acl = jsonencode(
          ~ {
              ~ tagOwners     = {
                  + "tag:k8s"           = [
                      + "tag:k8s-operator",
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id  = "dca925a2-b72b-a210-25af-3ccbdb1f4046"
    }

  # tailscale_federated_identity.k8s_operator will be created
  + resource "tailscale_federated_identity" "k8s_operator" {
      + audience    = (known after apply)
      + created_at  = (known after apply)
      + description = "lolice k8s-operator WIF"
      + id          = (known after apply)
      + issuer      = (known after apply)
      + scopes      = [
          + "auth_keys",
          + "devices:core",
          + "services",
        ]
      + subject     = "system:serviceaccount:tailscale-operator:operator"
      + tags        = [
          + "tag:k8s-operator",
        ]
      + updated_at  = (known after apply)
      + user_id     = (known after apply)
    }

Plan: 9 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + k8s_oidc_issuer_url        = (known after apply)
  + k8s_operator_wif_audience  = (known after apply)
  + k8s_operator_wif_client_id = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":7333,"Program":"tfcmt","SHA1":"6e8f58d254c1a6d8b75700ba7b21df2e4936e2f6","Target":"terraform/tailscale/lolice","Vars":{},"WorkflowName":"pull_request_target"} -->